{
  "app.title": "Nerdle",
  "app.loading": "Loading daily puzzle...",
  
  "header.help": "Help",
  "header.stats": "Statistics",
  
  "game.error.notEnough": "Not enough characters",
  "game.error.invalid": "Invalid equation",
  "game.error.notMathematical": "Equation is not mathematically correct",
  "game.won": "🎉 Congratulations! You got it!",
  "game.lost": "😔 Better luck next time! The answer was: {answer}",
  
  "help.title": "How to Play Nerdle",
  "help.objective.title": "🎯 Game Objective",
  "help.objective.text": "Guess the correct math equation in 6 tries. After each guess, the color of the tiles will change to show how close your guess was to the answer.",
  "help.rules.title": "🔢 Game Rules",
  "help.rules.1": "Each equation consists of 8 characters",
  "help.rules.2": "Must contain one equals sign (=)",
  "help.rules.3": "Right side of equals must be a number",
  "help.rules.4": "Available operators: +, -, *, /",
  "help.rules.5": "Follows standard order of operations (multiply/divide before add/subtract)",
  "help.rules.6": "Equation must be mathematically correct",
  "help.rules.7": "No leading zeros or negative numbers",
  "help.colors.title": "🎨 Color Guide",
  "help.colors.green": "Green",
  "help.colors.green.desc": "Character is in the correct position",
  "help.colors.purple": "Purple",
  "help.colors.purple.desc": "Character is in the equation but wrong position",
  "help.colors.gray": "Gray",
  "help.colors.gray.desc": "Character is not in the equation",
  "help.example.title": "🧩 Example",
  "help.example.answer": "If the answer is:",
  "help.example.guess": "And you guess:",
  "help.example.1": "9 shows purple (exists but wrong position)",
  "help.example.2": "* shows purple (operator exists but wrong position)",
  "help.example.3": "2 shows purple (exists but wrong position)",
  "help.example.4": "0 shows green (correct position)",
  "help.example.5": "Other characters show gray (not in answer)",
  "help.tips.title": "🧠 Strategy Tips",
  "help.tips.1": "Start with equations using different numbers and operators",
  "help.tips.2": "The equals sign is usually at position 5, 6, or 7",
  "help.tips.3": "Remember order of operations (multiply/divide first)",
  "help.tips.4": "Use color feedback to narrow down possibilities",
  "help.startPlaying": "Start Playing",
  
  "stats.title": "Statistics",
  "stats.congratulations": "🎉 Congratulations!",
  "stats.youWon": "You guessed today's equation",
  "stats.betterLuck": "😔 Better Luck Next Time",
  "stats.correctAnswer": "The correct answer was:",
  "stats.played": "Played",
  "stats.winRate": "Win Rate",
  "stats.currentStreak": "Current Streak",
  "stats.maxStreak": "Max Streak",
  "stats.guessDistribution": "Guess Distribution",
  "stats.nextNerdle": "Next Nerdle",
  "stats.close": "Close",
  
  "footer.copyright": "Nerdle - Math Equation Puzzle Game © 2025",
  "footer.description": "Daily challenge to exercise your mathematical thinking",
  "footer.github": "GitHub",
  "footer.chromeExt": "Chrome Extension",
  "footer.privacy": "Privacy Policy",
  "footer.terms": "Terms of Use",
  
  "seo.title": "Play Nerdle Game Online - Solve Mathematical Puzzles",
  "seo.description": "Play Nerdle, a math-based puzzle game that challenges your numerical logic. Solve puzzles, improve your skills, and enjoy hours of fun!",
  
  "seo.h1": "Nerdle Game: The Ultimate Math Puzzle Challenge",
  "seo.intro.title": "Introduction to Nerdle",
  "seo.intro.p1": "Nerdle is an exciting, brain-teasing math puzzle game that challenges your arithmetic skills and strategic thinking. Inspired by the popular word-guessing game Wordle, Nerdle flips the script by introducing a numerical twist. Instead of guessing letters, players need to solve a mathematical equation within six tries. This game is designed for math lovers, puzzle enthusiasts, and anyone who enjoys a good challenge. With its simple rules yet complex puzzles, Nerdle has become a favorite for individuals seeking to test and improve their math skills in a fun, engaging way.",
  "seo.intro.p2": "In this article, we'll dive deep into the Nerdle game mechanics, provide tips to improve your strategy, and explain why Nerdle is not just another puzzle game but an addictive experience for everyone.",
  "seo.what.title": "What is Nerdle?",
  "seo.what.p1": "Nerdle is an online math puzzle game where players have to guess a hidden mathematical equation within six attempts. Each equation consists of numbers, mathematical symbols (+, -, ×, ÷, etc.), and a solution, and the player needs to guess the correct equation.",
  "seo.what.p2": "Unlike traditional puzzles, Nerdle blends elements of logic, strategy, and basic arithmetic operations. The game offers multiple levels of difficulty, making it accessible for everyone, from math novices to seasoned mathematicians.",
  "seo.what.p3": "Players need to input their guesses into the grid, and the game will provide feedback about the accuracy of their guess. The feedback is color-coded:",
  "seo.what.green": "Green: The number or operator is in the correct position.",
  "seo.what.purple": "Purple: The number or operator is in the equation but not in the correct position.",
  "seo.what.black": "Black: The number or operator does not appear in the equation.",
  "seo.howto.title": "How to Play Nerdle?",
  "seo.howto.p": "Playing Nerdle is simple, but the challenge increases as you progress. Here's a step-by-step guide to playing:",
  "seo.howto.1": "Make Your First Guess: The game grid consists of eight slots. You need to input a valid mathematical equation with numbers and operators.",
  "seo.howto.2": "Get Feedback: After you submit your guess, the game will provide feedback with color-coded clues.",
  "seo.howto.3": "Refine Your Guess: Based on the feedback, you should refine your guesses to narrow down the correct equation.",
  "seo.howto.4": "Solve the Puzzle: Keep guessing until you either solve the puzzle or run out of attempts (maximum six guesses).",
  "seo.howto.p2": "Nerdle is not just about guessing the numbers but also involves understanding the relationships between operators and numbers. You'll need to think about which numbers make sense with specific mathematical operations to arrive at the correct equation.",
  "seo.why.title": "Why Nerdle is a Perfect Math Puzzle for Everyone",
  "seo.why.p": "Whether you're a casual player or someone who wants to sharpen your math skills, Nerdle offers a perfect balance of fun and challenge. Here's why:",
  "seo.why.1.title": "1. Engaging Gameplay",
  "seo.why.1.text": "Nerdle's gameplay is simple yet engaging. The challenge of guessing a math equation while receiving instant feedback keeps you on your toes, urging you to think quickly and logically. Each attempt refines your understanding of the puzzle, making each guess more educated than the last.",
  "seo.why.2.title": "2. Improves Math Skills",
  "seo.why.2.text": "Nerdle is more than just a game—it's an educational tool. Whether you're solving basic addition problems or more complex equations, Nerdle helps players practice their arithmetic skills. By playing regularly, you can improve your number sense and mental math abilities, making it a perfect game for students, teachers, and anyone who enjoys math.",
  "seo.why.3.title": "3. Stress-Free Fun",
  "seo.why.3.text": "Unlike many other math games that are intimidating, Nerdle is stress-free. The color-coded feedback allows players to learn from their mistakes without feeling frustrated. The game is designed to encourage critical thinking without overwhelming the player, making it ideal for those who enjoy a gentle challenge.",
  "seo.why.4.title": "4. Daily Puzzles",
  "seo.why.4.text": "One of the most appealing aspects of Nerdle is its daily puzzles. Every day, a new puzzle is available for players to solve, which keeps the game fresh and exciting. Players can compete with friends, share solutions, or just enjoy a solo challenge to beat their personal best.",
  "seo.strategies.title": "Nerdle Strategies: Tips to Improve Your Game",
  "seo.strategies.p": "While Nerdle is easy to pick up, it's not always easy to win. Here are some tips and strategies to help you improve your gameplay and solve the puzzles faster:",
  "seo.strategies.1.title": "1. Start with Simple Equations",
  "seo.strategies.1.text": "In the first few guesses, try starting with simple equations. This helps to establish a baseline and can provide useful feedback. You can start by guessing equations with small numbers and simple operations like addition or subtraction.",
  "seo.strategies.2.title": "2. Focus on Operators",
  "seo.strategies.2.text": "Operators are key in solving Nerdle puzzles. If you get a number wrong, you may still learn something valuable about the operators used in the equation. Pay close attention to whether your guesses fit with the arithmetic structure of the equation.",
  "seo.strategies.3.title": "3. Use Elimination",
  "seo.strategies.3.text": "One of the best ways to approach Nerdle is by using the process of elimination. Once you receive feedback, focus on eliminating numbers or operators that don't appear in the solution. This narrows down the possibilities and makes it easier to guess the correct equation.",
  "seo.strategies.4.title": "4. Think About Common Equations",
  "seo.strategies.4.text": "When you start narrowing down the equation, think about common math equations or formulas that might fit. For example, simple multiplication or division equations like \"4 × 5 = 20\" are common in Nerdle puzzles, so consider these possibilities when refining your guesses.",
  "seo.strategies.5.title": "5. Stay Calm and Logical",
  "seo.strategies.5.text": "Nerdle can be tricky, especially if you're on your final guess. The key is to stay calm and approach the puzzle logically. Break down the problem into smaller parts, analyze the feedback carefully, and make an educated guess based on the available clues.",
  "seo.popularity.title": "Why Nerdle is Gaining Popularity",
  "seo.popularity.p": "Nerdle is gaining traction for several reasons:",
  "seo.popularity.1": "It's Free and Accessible: Nerdle is completely free to play, making it accessible to a wide audience. Players don't need to download any apps or pay for a subscription to enjoy the game.",
  "seo.popularity.2": "It's for Everyone: Whether you're a math enthusiast or a casual gamer, Nerdle offers a fun experience for all skill levels.",
  "seo.popularity.3": "Social Media Buzz: Nerdle has gained popularity through social media platforms like Reddit and Twitter, where players share their puzzles, solutions, and achievements.",
  "seo.popularity.4": "It's Addictive: With its daily challenges and brain-teasing gameplay, Nerdle keeps players coming back for more.",
  "seo.allages.title": "Nerdle: A Game for All Ages",
  "seo.allages.p1": "Nerdle is suitable for players of all ages, from young children learning math to adults looking to improve their problem-solving skills. The game is a great way to practice arithmetic and logic, making it a perfect tool for students, teachers, and anyone who loves numbers.",
  "seo.allages.p2": "If you're looking for a fun, educational game that sharpens your math skills, Nerdle is the perfect choice. With its engaging gameplay and daily challenges, Nerdle keeps players of all ages entertained while promoting mental math and logical thinking.",
  "seo.conclusion.title": "Conclusion",
  "seo.conclusion.text": "In conclusion, Nerdle is not just a math game—it's a challenge that tests your problem-solving abilities and enhances your arithmetic skills. Whether you're new to math or an experienced problem solver, Nerdle offers something for everyone. Its unique blend of fun and educational content has made it a favorite among puzzle enthusiasts worldwide. So why wait? Start solving today and see if you can crack the Nerdle code!",
  "seo.keywords.title": "Keywords:",
  "seo.keywords.text": "Nerdle, math puzzle game, daily puzzle, number games, math games, problem-solving, arithmetic, logical thinking, educational games, number sense, math lovers."
}

