{
  "app.title": "Nerdle",
  "app.loading": "Cargando el rompecabezas diario...",
  
  "header.help": "Ayuda",
  "header.stats": "Estadísticas",
  
  "game.error.notEnough": "No hay suficientes caracteres",
  "game.error.invalid": "Ecuación inválida",
  "game.error.notMathematical": "La ecuación no es matemáticamente correcta",
  "game.won": "🎉 ¡Felicidades! ¡Lo lograste!",
  "game.lost": "😔 ¡Mejor suerte la próxima vez! La respuesta era: {answer}",
  
  "help.title": "Cómo Jugar Nerdle",
  "help.objective.title": "🎯 Objetivo del Juego",
  "help.objective.text": "Adivina la ecuación matemática correcta en 6 intentos. Después de cada intento, el color de los bloques cambiará para mostrar qué tan cerca estuvo tu intento de la respuesta.",
  "help.rules.title": "🔢 Reglas del Juego",
  "help.rules.1": "Cada ecuación consta de 8 caracteres",
  "help.rules.2": "Debe contener un signo igual (=)",
  "help.rules.3": "El lado derecho del igual debe ser un número",
  "help.rules.4": "Operadores disponibles: +, -, *, /",
  "help.rules.5": "Sigue el orden estándar de operaciones (multiplicar/dividir antes de sumar/restar)",
  "help.rules.6": "La ecuación debe ser matemáticamente correcta",
  "help.rules.7": "Sin ceros a la izquierda o números negativos",
  "help.colors.title": "🎨 Guía de Colores",
  "help.colors.green": "Verde",
  "help.colors.green.desc": "El carácter está en la posición correcta",
  "help.colors.purple": "Morado",
  "help.colors.purple.desc": "El carácter está en la ecuación pero en la posición incorrecta",
  "help.colors.gray": "Gris",
  "help.colors.gray.desc": "El carácter no está en la ecuación",
  "help.example.title": "🧩 Ejemplo",
  "help.example.answer": "Si la respuesta es:",
  "help.example.guess": "Y adivinas:",
  "help.example.1": "9 aparece en morado (existe pero en la posición incorrecta)",
  "help.example.2": "* aparece en morado (operador existe pero en la posición incorrecta)",
  "help.example.3": "2 aparece en morado (existe pero en la posición incorrecta)",
  "help.example.4": "0 aparece en verde (posición correcta)",
  "help.example.5": "Otros caracteres aparecen en gris (no están en la respuesta)",
  "help.tips.title": "🧠 Consejos de Estrategia",
  "help.tips.1": "Comienza con ecuaciones usando diferentes números y operadores",
  "help.tips.2": "El signo igual suele estar en la posición 5, 6 o 7",
  "help.tips.3": "Recuerda el orden de las operaciones (multiplicar/dividir primero)",
  "help.tips.4": "Usa la retroalimentación de colores para reducir las posibilidades",
  "help.startPlaying": "Comenzar a Jugar",
  
  "stats.title": "Estadísticas",
  "stats.congratulations": "🎉 ¡Felicidades!",
  "stats.youWon": "Adivinaste la ecuación de hoy",
  "stats.betterLuck": "😔 Mejor Suerte la Próxima Vez",
  "stats.correctAnswer": "La respuesta correcta era:",
  "stats.played": "Jugados",
  "stats.winRate": "Tasa de Victoria",
  "stats.currentStreak": "Racha Actual",
  "stats.maxStreak": "Racha Máxima",
  "stats.guessDistribution": "Distribución de Intentos",
  "stats.nextNerdle": "Próximo Nerdle",
  "stats.close": "Cerrar",
  
  "footer.copyright": "Nerdle - Juego de Rompecabezas de Ecuación Matemática © 2025",
  "footer.description": "Desafío diario para ejercitar tu pensamiento matemático",
  "footer.github": "GitHub",
  "footer.chromeExt": "Extensión de Chrome",
  "footer.privacy": "Política de Privacidad",
  "footer.terms": "Términos de Uso",
  
  "seo.title": "Juega Nerdle en Línea - Resuelve Rompecabezas Matemáticos",
  "seo.description": "Juega Nerdle, un juego de rompecabezas basado en matemáticas que desafía tu lógica numérica. ¡Resuelve rompecabezas, mejora tus habilidades y diviértete durante horas!",
  
  "seo.h1": "Juego Nerdle: El Desafío Definitivo de Rompecabezas Matemático",
  "seo.intro.title": "Introducción a Nerdle",
  "seo.intro.p1": "Nerdle es un emocionante juego de rompecabezas matemático que desafía tus habilidades aritméticas y pensamiento estratégico. Inspirado en el popular juego de adivinación de palabras Wordle, Nerdle cambia las reglas al introducir un giro numérico. En lugar de adivinar letras, los jugadores necesitan resolver una ecuación matemática en seis intentos. Este juego está diseñado para amantes de las matemáticas, entusiastas de los rompecabezas y cualquiera que disfrute de un buen desafío. Con sus reglas simples pero rompecabezas complejos, Nerdle se ha convertido en un favorito para personas que buscan probar y mejorar sus habilidades matemáticas de una manera divertida y atractiva.",
  "seo.intro.p2": "En este artículo, profundizaremos en la mecánica del juego Nerdle, proporcionaremos consejos para mejorar tu estrategia y explicaremos por qué Nerdle no es solo otro juego de rompecabezas, sino una experiencia adictiva para todos.",
  "seo.what.title": "¿Qué es Nerdle?",
  "seo.what.p1": "Nerdle es un juego de rompecabezas matemático en línea donde los jugadores deben adivinar una ecuación matemática oculta en seis intentos. Cada ecuación consta de números, símbolos matemáticos (+, -, ×, ÷, etc.) y una solución, y el jugador necesita adivinar la ecuación correcta.",
  "seo.what.p2": "A diferencia de los rompecabezas tradicionales, Nerdle mezcla elementos de lógica, estrategia y operaciones aritméticas básicas. El juego ofrece múltiples niveles de dificultad, haciéndolo accesible para todos, desde novatos en matemáticas hasta matemáticos experimentados.",
  "seo.what.p3": "Los jugadores necesitan ingresar sus intentos en la cuadrícula, y el juego proporcionará retroalimentación sobre la precisión de su intento. La retroalimentación está codificada por colores:",
  "seo.what.green": "Verde: El número u operador está en la posición correcta.",
  "seo.what.purple": "Morado: El número u operador está en la ecuación pero no en la posición correcta.",
  "seo.what.black": "Negro: El número u operador no aparece en la ecuación.",
  "seo.howto.title": "¿Cómo Jugar Nerdle?",
  "seo.howto.p": "Jugar Nerdle es simple, pero el desafío aumenta a medida que avanzas. Aquí hay una guía paso a paso para jugar:",
  "seo.howto.1": "Haz Tu Primera Suposición: La cuadrícula del juego consta de ocho espacios. Necesitas ingresar una ecuación matemática válida con números y operadores.",
  "seo.howto.2": "Obtén Retroalimentación: Después de enviar tu intento, el juego proporcionará retroalimentación con pistas codificadas por colores.",
  "seo.howto.3": "Refina Tu Intento: Basándote en la retroalimentación, debes refinar tus intentos para reducir la ecuación correcta.",
  "seo.howto.4": "Resuelve el Rompecabezas: Continúa adivinando hasta que resuelvas el rompecabezas o te quedes sin intentos (máximo seis intentos).",
  "seo.howto.p2": "Nerdle no se trata solo de adivinar los números, sino que también implica comprender las relaciones entre operadores y números. Necesitarás pensar qué números tienen sentido con operaciones matemáticas específicas para llegar a la ecuación correcta.",
  "seo.why.title": "Por qué Nerdle es un Rompecabezas Matemático Perfecto para Todos",
  "seo.why.p": "Ya seas un jugador casual o alguien que quiere perfeccionar sus habilidades matemáticas, Nerdle ofrece un equilibrio perfecto de diversión y desafío. Aquí está el porqué:",
  "seo.why.1.title": "1. Jugabilidad Atractiva",
  "seo.why.1.text": "La jugabilidad de Nerdle es simple pero atractiva. El desafío de adivinar una ecuación matemática mientras recibes retroalimentación instantánea te mantiene alerta, instándote a pensar rápida y lógicamente. Cada intento refina tu comprensión del rompecabezas, haciendo que cada suposición sea más fundamentada que la anterior.",
  "seo.why.2.title": "2. Mejora las Habilidades Matemáticas",
  "seo.why.2.text": "Nerdle es más que solo un juego: es una herramienta educativa. Ya sea resolviendo problemas básicos de suma o ecuaciones más complejas, Nerdle ayuda a los jugadores a practicar sus habilidades aritméticas. Al jugar regularmente, puedes mejorar tu sentido numérico y habilidades de cálculo mental, convirtiéndolo en un juego perfecto para estudiantes, profesores y cualquiera que disfrute de las matemáticas.",
  "seo.why.3.title": "3. Diversión Sin Estrés",
  "seo.why.3.text": "A diferencia de muchos otros juegos de matemáticas que son intimidantes, Nerdle está libre de estrés. La retroalimentación codificada por colores permite a los jugadores aprender de sus errores sin sentirse frustrados. El juego está diseñado para fomentar el pensamiento crítico sin abrumar al jugador, haciéndolo ideal para aquellos que disfrutan de un desafío suave.",
  "seo.why.4.title": "4. Rompecabezas Diarios",
  "seo.why.4.text": "Uno de los aspectos más atractivos de Nerdle son sus rompecabezas diarios. Cada día, hay un nuevo rompecabezas disponible para que los jugadores lo resuelvan, lo que mantiene el juego fresco y emocionante. Los jugadores pueden competir con amigos, compartir soluciones o simplemente disfrutar de un desafío en solitario para superar su mejor marca personal.",
  "seo.strategies.title": "Estrategias de Nerdle: Consejos para Mejorar Tu Juego",
  "seo.strategies.p": "Aunque Nerdle es fácil de empezar, no siempre es fácil ganar. Aquí hay algunos consejos y estrategias para ayudarte a mejorar tu jugabilidad y resolver los rompecabezas más rápido:",
  "seo.strategies.1.title": "1. Comienza con Ecuaciones Simples",
  "seo.strategies.1.text": "En los primeros intentos, intenta comenzar con ecuaciones simples. Esto ayuda a establecer una línea base y puede proporcionar retroalimentación útil. Puedes comenzar adivinando ecuaciones con números pequeños y operaciones simples como suma o resta.",
  "seo.strategies.2.title": "2. Concéntrate en los Operadores",
  "seo.strategies.2.text": "Los operadores son clave para resolver rompecabezas de Nerdle. Si te equivocas en un número, aún puedes aprender algo valioso sobre los operadores usados en la ecuación. Presta mucha atención a si tus intentos encajan con la estructura aritmética de la ecuación.",
  "seo.strategies.3.title": "3. Usa la Eliminación",
  "seo.strategies.3.text": "Una de las mejores formas de abordar Nerdle es usando el proceso de eliminación. Una vez que recibas retroalimentación, concéntrate en eliminar números u operadores que no aparezcan en la solución. Esto reduce las posibilidades y hace más fácil adivinar la ecuación correcta.",
  "seo.strategies.4.title": "4. Piensa en Ecuaciones Comunes",
  "seo.strategies.4.text": "Cuando comiences a reducir la ecuación, piensa en ecuaciones matemáticas o fórmulas comunes que puedan encajar. Por ejemplo, ecuaciones simples de multiplicación o división como \"4 × 5 = 20\" son comunes en los rompecabezas de Nerdle, así que considera estas posibilidades al refinar tus intentos.",
  "seo.strategies.5.title": "5. Mantén la Calma y la Lógica",
  "seo.strategies.5.text": "Nerdle puede ser complicado, especialmente si estás en tu último intento. La clave es mantener la calma y abordar el rompecabezas lógicamente. Divide el problema en partes más pequeñas, analiza la retroalimentación cuidadosamente y haz un intento fundamentado basado en las pistas disponibles.",
  "seo.popularity.title": "Por qué Nerdle Está Ganando Popularidad",
  "seo.popularity.p": "Nerdle está ganando tracción por varias razones:",
  "seo.popularity.1": "Es Gratis y Accesible: Nerdle es completamente gratuito para jugar, haciéndolo accesible para una amplia audiencia. Los jugadores no necesitan descargar ninguna aplicación ni pagar una suscripción para disfrutar del juego.",
  "seo.popularity.2": "Es para Todos: Ya seas un entusiasta de las matemáticas o un jugador casual, Nerdle ofrece una experiencia divertida para todos los niveles de habilidad.",
  "seo.popularity.3": "Rumor en Redes Sociales: Nerdle ha ganado popularidad a través de plataformas de redes sociales como Reddit y Twitter, donde los jugadores comparten sus rompecabezas, soluciones y logros.",
  "seo.popularity.4": "Es Adictivo: Con sus desafíos diarios y jugabilidad de rompecabezas mental, Nerdle mantiene a los jugadores regresando por más.",
  "seo.allages.title": "Nerdle: Un Juego para Todas las Edades",
  "seo.allages.p1": "Nerdle es adecuado para jugadores de todas las edades, desde niños pequeños que aprenden matemáticas hasta adultos que buscan mejorar sus habilidades de resolución de problemas. El juego es una excelente manera de practicar aritmética y lógica, convirtiéndolo en una herramienta perfecta para estudiantes, profesores y cualquiera que ame los números.",
  "seo.allages.p2": "Si estás buscando un juego divertido y educativo que agudice tus habilidades matemáticas, Nerdle es la elección perfecta. Con su jugabilidad atractiva y desafíos diarios, Nerdle mantiene entretenidos a jugadores de todas las edades mientras promueve el cálculo mental y el pensamiento lógico.",
  "seo.conclusion.title": "Conclusión",
  "seo.conclusion.text": "En conclusión, Nerdle no es solo un juego de matemáticas: es un desafío que prueba tus habilidades de resolución de problemas y mejora tus habilidades aritméticas. Ya seas nuevo en las matemáticas o un solucionador de problemas experimentado, Nerdle ofrece algo para todos. Su mezcla única de contenido divertido y educativo lo ha convertido en un favorito entre los entusiastas de los rompecabezas en todo el mundo. Entonces, ¿por qué esperar? ¡Comienza a resolver hoy y ve si puedes descifrar el código Nerdle!",
  "seo.keywords.title": "Palabras clave:",
  "seo.keywords.text": "Nerdle, juego de rompecabezas matemático, rompecabezas diario, juegos de números, juegos de matemáticas, resolución de problemas, aritmética, pensamiento lógico, juegos educativos, sentido numérico, amantes de las matemáticas."
}

