{
  "app.title": "Nerdle",
  "app.loading": "Carregando quebra-cabeça diário...",
  
  "header.help": "Ajuda",
  "header.stats": "Estatísticas",
  
  "game.error.notEnough": "Não há caracteres suficientes",
  "game.error.invalid": "Equação inválida",
  "game.error.notMathematical": "A equação não está matematicamente correta",
  "game.won": "🎉 Parabéns! Você acertou!",
  "game.lost": "😔 Mais sorte da próxima vez! A resposta era: {answer}",
  
  "help.title": "Como Jogar Nerdle",
  "help.objective.title": "🎯 Objetivo do Jogo",
  "help.objective.text": "Adivinhe a equação matemática correta em 6 tentativas. Após cada palpite, a cor dos blocos mudará para mostrar o quão perto seu palpite estava da resposta.",
  "help.rules.title": "🔢 Regras do Jogo",
  "help.rules.1": "Cada equação consiste em 8 caracteres",
  "help.rules.2": "Deve conter um sinal de igual (=)",
  "help.rules.3": "O lado direito do igual deve ser um número",
  "help.rules.4": "Operadores disponíveis: +, -, *, /",
  "help.rules.5": "Segue a ordem padrão de operações (multiplicar/dividir antes de somar/subtrair)",
  "help.rules.6": "A equação deve estar matematicamente correta",
  "help.rules.7": "Sem zeros à esquerda ou números negativos",
  "help.colors.title": "🎨 Guia de Cores",
  "help.colors.green": "Verde",
  "help.colors.green.desc": "O caractere está na posição correta",
  "help.colors.purple": "Roxo",
  "help.colors.purple.desc": "O caractere está na equação, mas na posição errada",
  "help.colors.gray": "Cinza",
  "help.colors.gray.desc": "O caractere não está na equação",
  "help.example.title": "🧩 Exemplo",
  "help.example.answer": "Se a resposta for:",
  "help.example.guess": "E você adivinhar:",
  "help.example.1": "9 aparece em roxo (existe mas na posição errada)",
  "help.example.2": "* aparece em roxo (operador existe mas na posição errada)",
  "help.example.3": "2 aparece em roxo (existe mas na posição errada)",
  "help.example.4": "0 aparece em verde (posição correta)",
  "help.example.5": "Outros caracteres aparecem em cinza (não estão na resposta)",
  "help.tips.title": "🧠 Dicas de Estratégia",
  "help.tips.1": "Comece com equações usando números e operadores diferentes",
  "help.tips.2": "O sinal de igual geralmente está na posição 5, 6 ou 7",
  "help.tips.3": "Lembre-se da ordem das operações (multiplicar/dividir primeiro)",
  "help.tips.4": "Use o feedback de cores para reduzir as possibilidades",
  "help.startPlaying": "Começar a Jogar",
  
  "stats.title": "Estatísticas",
  "stats.congratulations": "🎉 Parabéns!",
  "stats.youWon": "Você adivinhou a equação de hoje",
  "stats.betterLuck": "😔 Mais Sorte da Próxima Vez",
  "stats.correctAnswer": "A resposta correta era:",
  "stats.played": "Jogados",
  "stats.winRate": "Taxa de Vitória",
  "stats.currentStreak": "Sequência Atual",
  "stats.maxStreak": "Sequência Máxima",
  "stats.guessDistribution": "Distribuição de Palpites",
  "stats.nextNerdle": "Próximo Nerdle",
  "stats.close": "Fechar",
  
  "footer.copyright": "Nerdle - Jogo de Quebra-cabeça de Equação Matemática © 2025",
  "footer.description": "Desafio diário para exercitar seu pensamento matemático",
  "footer.github": "GitHub",
  "footer.chromeExt": "Extensão Chrome",
  "footer.privacy": "Política de Privacidade",
  "footer.terms": "Termos de Uso",
  
  "seo.title": "Jogue Nerdle Online - Resolva Quebra-cabeças Matemáticos",
  "seo.description": "Jogue Nerdle, um jogo de quebra-cabeça baseado em matemática que desafia sua lógica numérica. Resolva quebra-cabeças, melhore suas habilidades e divirta-se por horas!",
  
  "seo.h1": "Jogo Nerdle: O Desafio Definitivo de Quebra-cabeça Matemático",
  "seo.intro.title": "Introdução ao Nerdle",
  "seo.intro.p1": "Nerdle é um emocionante jogo de quebra-cabeça matemático que desafia suas habilidades aritméticas e pensamento estratégico. Inspirado no popular jogo de adivinhação de palavras Wordle, Nerdle vira o jogo ao introduzir uma reviravolta numérica. Em vez de adivinhar letras, os jogadores precisam resolver uma equação matemática em seis tentativas. Este jogo é projetado para amantes de matemática, entusiastas de quebra-cabeças e qualquer pessoa que goste de um bom desafio. Com suas regras simples, mas quebra-cabeças complexos, Nerdle se tornou um favorito para indivíduos que buscam testar e melhorar suas habilidades matemáticas de uma maneira divertida e envolvente.",
  "seo.intro.p2": "Neste artigo, vamos mergulhar profundamente na mecânica do jogo Nerdle, fornecer dicas para melhorar sua estratégia e explicar por que Nerdle não é apenas outro jogo de quebra-cabeça, mas uma experiência viciante para todos.",
  "seo.what.title": "O que é Nerdle?",
  "seo.what.p1": "Nerdle é um jogo de quebra-cabeça matemático online onde os jogadores devem adivinhar uma equação matemática oculta em seis tentativas. Cada equação consiste em números, símbolos matemáticos (+, -, ×, ÷, etc.) e uma solução, e o jogador precisa adivinhar a equação correta.",
  "seo.what.p2": "Ao contrário dos quebra-cabeças tradicionais, Nerdle mistura elementos de lógica, estratégia e operações aritméticas básicas. O jogo oferece vários níveis de dificuldade, tornando-o acessível para todos, de iniciantes em matemática a matemáticos experientes.",
  "seo.what.p3": "Os jogadores precisam inserir seus palpites na grade, e o jogo fornecerá feedback sobre a precisão de seu palpite. O feedback é codificado por cores:",
  "seo.what.green": "Verde: O número ou operador está na posição correta.",
  "seo.what.purple": "Roxo: O número ou operador está na equação, mas não na posição correta.",
  "seo.what.black": "Preto: O número ou operador não aparece na equação.",
  "seo.howto.title": "Como Jogar Nerdle?",
  "seo.howto.p": "Jogar Nerdle é simples, mas o desafio aumenta conforme você progride. Aqui está um guia passo a passo para jogar:",
  "seo.howto.1": "Faça Seu Primeiro Palpite: A grade do jogo consiste em oito espaços. Você precisa inserir uma equação matemática válida com números e operadores.",
  "seo.howto.2": "Obtenha Feedback: Depois de enviar seu palpite, o jogo fornecerá feedback com pistas codificadas por cores.",
  "seo.howto.3": "Refine Seu Palpite: Com base no feedback, você deve refinar seus palpites para reduzir a equação correta.",
  "seo.howto.4": "Resolva o Quebra-cabeça: Continue adivinhando até resolver o quebra-cabeça ou ficar sem tentativas (máximo de seis palpites).",
  "seo.howto.p2": "Nerdle não é apenas sobre adivinhar os números, mas também envolve entender as relações entre operadores e números. Você precisará pensar sobre quais números fazem sentido com operações matemáticas específicas para chegar à equação correta.",
  "seo.why.title": "Por que Nerdle é um Quebra-cabeça Matemático Perfeito para Todos",
  "seo.why.p": "Seja você um jogador casual ou alguém que quer aprimorar suas habilidades matemáticas, Nerdle oferece um equilíbrio perfeito de diversão e desafio. Aqui está o porquê:",
  "seo.why.1.title": "1. Jogabilidade Envolvente",
  "seo.why.1.text": "A jogabilidade do Nerdle é simples, mas envolvente. O desafio de adivinhar uma equação matemática enquanto recebe feedback instantâneo mantém você alerta, incentivando você a pensar rápida e logicamente. Cada tentativa refina sua compreensão do quebra-cabeça, tornando cada palpite mais fundamentado que o anterior.",
  "seo.why.2.title": "2. Melhora Habilidades Matemáticas",
  "seo.why.2.text": "Nerdle é mais do que apenas um jogo—é uma ferramenta educacional. Seja resolvendo problemas básicos de adição ou equações mais complexas, Nerdle ajuda os jogadores a praticar suas habilidades aritméticas. Jogando regularmente, você pode melhorar seu senso numérico e habilidades de matemática mental, tornando-o um jogo perfeito para estudantes, professores e qualquer pessoa que goste de matemática.",
  "seo.why.3.title": "3. Diversão Sem Estresse",
  "seo.why.3.text": "Ao contrário de muitos outros jogos de matemática que são intimidantes, Nerdle é livre de estresse. O feedback codificado por cores permite que os jogadores aprendam com seus erros sem se sentir frustrados. O jogo é projetado para encorajar o pensamento crítico sem sobrecarregar o jogador, tornando-o ideal para aqueles que gostam de um desafio suave.",
  "seo.why.4.title": "4. Quebra-cabeças Diários",
  "seo.why.4.text": "Um dos aspectos mais atraentes do Nerdle são seus quebra-cabeças diários. Todos os dias, um novo quebra-cabeça está disponível para os jogadores resolverem, o que mantém o jogo fresco e emocionante. Os jogadores podem competir com amigos, compartilhar soluções ou simplesmente desfrutar de um desafio solo para bater seu melhor pessoal.",
  "seo.strategies.title": "Estratégias Nerdle: Dicas para Melhorar Seu Jogo",
  "seo.strategies.p": "Embora Nerdle seja fácil de começar, nem sempre é fácil ganhar. Aqui estão algumas dicas e estratégias para ajudá-lo a melhorar sua jogabilidade e resolver os quebra-cabeças mais rapidamente:",
  "seo.strategies.1.title": "1. Comece com Equações Simples",
  "seo.strategies.1.text": "Nos primeiros palpites, tente começar com equações simples. Isso ajuda a estabelecer uma linha de base e pode fornecer feedback útil. Você pode começar adivinhando equações com números pequenos e operações simples como adição ou subtração.",
  "seo.strategies.2.title": "2. Concentre-se nos Operadores",
  "seo.strategies.2.text": "Os operadores são fundamentais para resolver quebra-cabeças Nerdle. Se você errar um número, ainda poderá aprender algo valioso sobre os operadores usados na equação. Preste muita atenção se seus palpites se encaixam na estrutura aritmética da equação.",
  "seo.strategies.3.title": "3. Use Eliminação",
  "seo.strategies.3.text": "Uma das melhores maneiras de abordar Nerdle é usando o processo de eliminação. Depois de receber feedback, concentre-se em eliminar números ou operadores que não aparecem na solução. Isso reduz as possibilidades e torna mais fácil adivinhar a equação correta.",
  "seo.strategies.4.title": "4. Pense em Equações Comuns",
  "seo.strategies.4.text": "Quando você começar a reduzir a equação, pense em equações matemáticas ou fórmulas comuns que possam se encaixar. Por exemplo, equações simples de multiplicação ou divisão como \"4 × 5 = 20\" são comuns em quebra-cabeças Nerdle, então considere essas possibilidades ao refinar seus palpites.",
  "seo.strategies.5.title": "5. Mantenha a Calma e a Lógica",
  "seo.strategies.5.text": "Nerdle pode ser complicado, especialmente se você estiver no seu último palpite. A chave é manter a calma e abordar o quebra-cabeça logicamente. Divida o problema em partes menores, analise o feedback cuidadosamente e faça um palpite fundamentado com base nas pistas disponíveis.",
  "seo.popularity.title": "Por que Nerdle Está Ganhando Popularidade",
  "seo.popularity.p": "Nerdle está ganhando destaque por várias razões:",
  "seo.popularity.1": "É Grátis e Acessível: Nerdle é completamente gratuito para jogar, tornando-o acessível a um público amplo. Os jogadores não precisam baixar aplicativos ou pagar por uma assinatura para aproveitar o jogo.",
  "seo.popularity.2": "É para Todos: Seja você um entusiasta de matemática ou um jogador casual, Nerdle oferece uma experiência divertida para todos os níveis de habilidade.",
  "seo.popularity.3": "Buzz nas Redes Sociais: Nerdle ganhou popularidade através de plataformas de mídia social como Reddit e Twitter, onde os jogadores compartilham seus quebra-cabeças, soluções e conquistas.",
  "seo.popularity.4": "É Viciante: Com seus desafios diários e jogabilidade de quebra-cabeça mental, Nerdle mantém os jogadores voltando para mais.",
  "seo.allages.title": "Nerdle: Um Jogo para Todas as Idades",
  "seo.allages.p1": "Nerdle é adequado para jogadores de todas as idades, desde crianças pequenas aprendendo matemática até adultos que procuram melhorar suas habilidades de resolução de problemas. O jogo é uma ótima maneira de praticar aritmética e lógica, tornando-o uma ferramenta perfeita para estudantes, professores e qualquer pessoa que ame números.",
  "seo.allages.p2": "Se você está procurando um jogo divertido e educacional que aprimora suas habilidades matemáticas, Nerdle é a escolha perfeita. Com sua jogabilidade envolvente e desafios diários, Nerdle mantém jogadores de todas as idades entretidos enquanto promove matemática mental e pensamento lógico.",
  "seo.conclusion.title": "Conclusão",
  "seo.conclusion.text": "Em conclusão, Nerdle não é apenas um jogo de matemática—é um desafio que testa suas habilidades de resolução de problemas e aprimora suas habilidades aritméticas. Seja você novo em matemática ou um solucionador de problemas experiente, Nerdle oferece algo para todos. Sua mistura única de conteúdo divertido e educacional tornou-o um favorito entre entusiastas de quebra-cabeças em todo o mundo. Então por que esperar? Comece a resolver hoje e veja se você pode decifrar o código Nerdle!",
  "seo.keywords.title": "Palavras-chave:",
  "seo.keywords.text": "Nerdle, jogo de quebra-cabeça matemático, quebra-cabeça diário, jogos de números, jogos de matemática, resolução de problemas, aritmética, pensamento lógico, jogos educacionais, senso numérico, amantes de matemática."
}

